{
  "header.title": "BattleGame",
  "header.logout": "Ausloggen",
  "header.googleSignIn": "Google",
  "header.emailSignIn": "E-Mail",
  "aria.closeModal": "Modal schließen",
  "authModal.loginTitle": "Anmelden",
  "authModal.signUpTitle": "Registrieren",
  "authModal.emailLabel": "E-Mail",
  "authModal.passwordLabel": "Passwort",
  "authModal.loginButton": "Anmelden",
  "authModal.signUpButton": "Registrieren",
  "authModal.switchToSignUp": "Kein Konto? Registrieren",
  "authModal.switchToLogin": "Bereits ein Konto? Anmelden",
  "authModal.orSeparator": "ODER",
  "authModal.googleContinue": "Weiter mit Google",
  "logout.success": "Erfolgreich abgemeldet.",
  "logout.failure": "Abmeldung fehlgeschlagen: {{message}}",
  "login.emailSuccess": "Erfolgreich angemeldet!",
  "signup.emailSuccess": "Konto erfolgreich erstellt! Bitte anmelden.",
  "login.googleSuccess": "Erfolgreich mit Google angemeldet!",
  "login.googleFailure": "Google-Anmeldung fehlgeschlagen: {{message}}",
  "login.invalidCredentials": "Ungültige E-Mail oder Passwort.",
  "validation.emailRequired": "E-Mail ist erforderlich.",
  "validation.emailInvalid": "E-Mail ist ungültig.",
  "validation.passwordRequired": "Passwort ist erforderlich.",
  "validation.passwordMinLength": "Passwort muss mindestens {{length}} Zeichen lang sein.",
  "validation.emailInUse": "Diese E-Mail wird bereits verwendet. Versuchen Sie sich anzumelden.",
  "error.general": "Fehler: {{message}}",

  "landingPage.hero.title": "BattleGame",
  "landingPage.hero.playingNow": "Spielen!",
  "landingPage.hero.subtitle": "Verfolge die Entwicklung eines epischen 2D-Kreaturen-Kampfspiels. Von der einzelnen Zelle zum ultimativen Champion!",
  "landingPage.footer.copyright": "© {{year}} BattleGame. Entwicklung im Gange.",

  "landingPage.blog.title": "Aktuelle Nachrichten & Updates",
  "landingPage.blog.readMore": "Weiterlesen",
  "landingPage.blog.noPosts": "Noch keine Blog-Beiträge. Schau bald wieder vorbei für Updates!",
  "landingPage.blog.posts.dateFormat": "{{date, long}}",
  "landingPage.blog.posts.1.title": "Projektstart & Kernkonzepte!",
  "landingPage.blog.posts.1.summary": "Willkommen zum ersten Update! Wir freuen uns, diese Reise zu beginnen und BattleGame zu entwickeln. Die Kernkonzepte stehen fest, und wir beginnen mit dem Prototyping der ersten Zellphase. Bleib dran für weitere Updates, während wir diese Ideen zum Leben erwecken!",
  "landingPage.blog.posts.2.title": "Frühe Kreaturen-Evolutions-Mockups",
  "landingPage.blog.posts.2.summary": "Diese Woche haben wir einige frühe Ideen für die Kreaturenevolution und die Benutzeroberfläche der 'Evolutionskammer' skizziert. Wir versuchen, eine coole Pixel-Art-Ästhetik mit klarer Informationsdarstellung in Einklang zu bringen. Einige interessante Herausforderungen stehen bevor!",
  "landingPage.blog.posts.3.title": "Technologie-Stack-Entscheidungen: Firebase & MUI",
  "landingPage.blog.posts.3.summary": "Wir haben Teile unseres Technologie-Stacks festgelegt! Firebase wird unsere Backend-Anforderungen einschließlich Authentifizierung und Datenbank übernehmen. Für das Frontend setzen wir auf React mit Material-UI (MUI), um eine reaktionsschnelle und moderne Benutzeroberfläche zu erstellen, während wir weiterhin das individuelle Spielgefühl anstreben.",

  "landingPage.phases.mainTitle": "Die Reise einer Kreatur",
  "landingPage.phases.conceptArtAlt": "Konzeptzeichnung für {{title}} {{number}}",
  "landingPage.phases.phase1.title": "Phase 1: Ressourcen sammeln",
  "landingPage.phases.phase1.description": "Beginne als bescheidene Zelle in einer lebendigen, wackeligen Welt voller Leben und Gefahren. Verbrauche Plankton und Mikrozellen, um zu wachsen, aber sei vorsichtig – andere Spieler könnten dich als Snack oder Bedrohung ansehen! Jede Interaktion kann zu Wachstum, Verletzung oder sogar Absorption führen. Während du dich entwickelst, entwickelt sich auch die Welt und stellt neue Herausforderungen und ein komplexeres Ressourcenmanagement dar. Es ist eine einzigartige Mischung aus Spores Evolution, Agar.ios Überleben und Minecrafts Einfallsreichtum.",
  "landingPage.phases.phase1.imageAlt": "Pixel-Art-Bild einer kleinen Zelle in einer lebendigen Umgebung, das Phase 1 darstellt: Ressourcen sammeln.",
  "landingPage.phases.phase2.title": "Phase 2: Wachsen & Formen",
  "landingPage.phases.phase2.description": "Evolution ist der Schlüssel. Nachdem du ausreichend Ressourcen gesammelt oder Meilensteine erreicht hast, betritt die Evolutionskammer. Hier fügst du deiner Kreatur strategisch Merkmale hinzu – Sinne, Gliedmaßen, Rüstung, Stacheln und mehr. Dies ist kein einmaliges Ereignis; du kannst diese Phase erneut besuchen, um deine Kreatur anzupassen und zu verbessern, während du Fortschritte machst und neue Möglichkeiten freischaltest.",
  "landingPage.phases.phase2.imageAlt": "Pixel-Art-Bilder, die Kreaturen-Evolutionsstadien zeigen und Phase 2 darstellen: Wachsen & Formen.",
  "landingPage.phases.phase3.title": "Phase 3: Waffen erstellen",
  "landingPage.phases.phase3.description": "Dieselben grundlegenden Ressourcen, die das Wachstum deiner Kreatur antreiben, können zu mächtigen Waffen geschmiedet werden. Tauche ein in ein fortschrittliches Handwerkssystem, das an Little Alchemy erinnert, aber mit tiefem Statistikmanagement und einem World of Warcraft-ähnlichen Gefühl für das Ausbalancieren der angeborenen Fähigkeiten deiner Kreatur mit ihrem ausgerüsteten Arsenal. Jede Waffenwahl beeinflusst deinen Kampfstil.",
  "landingPage.phases.phase3.imageAlt": "Pixel-Art-Bild einer Kreatur mit hergestellten Waffen, das Phase 3 darstellt: Waffen erstellen.",
  "landingPage.phases.phase4.title": "Phase 4: Bewegung lehren",
  "landingPage.phases.phase4.description": "Hier wirst du zum Spieledesigner. Definiere jede Bewegung deiner Kreatur. Mithilfe einer ausgeklügelten Physik-Engine weist du Punkte (verdient durch Sammeln) Parametern wie Schwerkrafteinfluss, Luftwiderstand, Bewegungsgeschwindigkeit und Stärke zu. Dann ordnest du diese den Eingaben deines Geräts zu. Programmiere den genauen Bogen eines Schwungs, die Kraft eines Sprungs oder die Feinheiten einer Verteidigungshaltung. Deine Kreativität bei der Programmierung überträgt sich direkt auf die Effektivität deiner Kreatur.",
  "landingPage.phases.phase4.imageAlt": "Pixel-Art-Bild, das eine Kreatur mit einer Programmieroberfläche für Bewegung oder Fähigkeiten darstellt und Phase 4 repräsentiert: Bewegung lehren.",
  "landingPage.phases.phase5.title": "Phase 5: Training",
  "landingPage.phases.phase5.description": "Verfeinere deine Fähigkeiten und teste die programmierten Fähigkeiten deiner Kreatur in einem speziellen Offline-Trainingsmodus. Tritt gegen verschiedene KI-gesteuerte Bots auf unterschiedlichen Herausforderungsstufen an. Dies ist der perfekte Ort, um mit neuen Bewegungsprogrammen, Waffenkombinationen und Kampfstrategien zu experimentieren, bevor du dich in Live-Kämpfe stürzt. (Weitere Details zum Trainingsmodus folgen in Kürze!)",
  "landingPage.phases.phase5.imageAlt": "Pixel-Art-Bild einer Kreatur in einer Trainingsumgebung, das Phase 5 darstellt: Training.",
  "landingPage.phases.phase6.title": "Phase 6: Online-Kämpfe",
  "landingPage.phases.phase6.description": "Der ultimative Test! Nimm an spannenden Online-Kämpfen gegen andere Spieler und ihre einzigartigen Kreaturen teil. Mit einem Matchmaking-System, das von Brawlhalla und Tekken inspiriert ist, erwarten dich intensive 1-gegen-1-Duelle, chaotische 2-gegen-2-Teamkämpfe und strukturierte Turniere. Steige in den Rängen auf und beweise, dass deine Kreatur der ultimative Champion ist. Es ist wie Roboterkämpfe im echten Leben, aber mit grenzenlosen kreativen Möglichkeiten!",
  "landingPage.phases.phase6.imageAlt": "Pixel-Art-Bild von Kreaturen, die online kämpfen und Phase 6 darstellen: Online-Kämpfe.",
  "landingPage.phases.header": "Übersicht Spielphasen",

  "gameStartPage.title": "Willkommen zum Spiel!",
  "gameStartPage.intro": "Mach dich bereit für ein aufregendes Abenteuer. Klicke auf den Button unten, um deine Reise zu beginnen.",
  "gameStartPage.startGameButton": "Spiel starten",
  "gameStartPage.logoutButton": "Ausloggen",
  "gameStartPage.imageAlt1": "Aufregende Spielszene",
  "gameStartPage.imageCaption1": "Erkunde riesige Welten und entdecke Geheimnisse.",
  "gameStartPage.imageAlt2": "Highlight eines Spiel-Features",
  "gameStartPage.imageCaption2": "Meistere einzigartige Fähigkeiten und Herausforderungen.",
  "gameStartPage.footerNote": "Stelle sicher, dass du eine stabile Internetverbindung für das beste Erlebnis hast.",

  "gameContainerPage.gameAreaTitle": "Spielbereich",
  "gameContainerPage.gameAreaInstructions": "Dein Spiel wird hier gerendert.",
  "gameContainerPage.fullscreenInfo": "Drücke ESC zum Pausieren.",
  "gameContainerPage.pauseModal.title": "Spiel pausiert",
  "gameContainerPage.pauseModal.description": "Das Spiel ist derzeit pausiert. Was möchtest du tun?",
  "gameContainerPage.pauseModal.resumeButton": "Fortsetzen",
  "gameContainerPage.pauseModal.quitButton": "Zum Menü",

  "snackbar.loginSuccessTitle": "Anmeldung erfolgreich",
  "snackbar.loginSuccessMessage": "Willkommen zurück, {{userName}}!",
  "snackbar.loginErrorTitle": "Anmeldung fehlgeschlagen",
  "snackbar.loginErrorMessage": "{{errorMessage}}",
  "snackbar.logoutSuccessTitle": "Abgemeldet",
  "snackbar.logoutSuccessMessage": "Du wurdest erfolgreich abgemeldet.",
  "snackbar.logoutErrorTitle": "Abmeldung fehlgeschlagen",
  "snackbar.logoutErrorMessage": "Während der Abmeldung ist ein Fehler aufgetreten. {{errorMessage}}",

  "phase1.blogTitle": "Phase 1: Der Ressourcenrausch - Ein genauerer Blick",
  "phase1.stadium1.title": "Stadionkonzept 1",
  "phase1.stadium1.description": "Frühes Konzept für ein lebendiges, ressourcenreiches Startgebiet. Fokus auf visuelle Klarheit und sofortiges Verständnis der sammelbaren Elemente.",
  "phase1.stadium4.title": "Stadionkonzept 4",
  "phase1.stadium4.description": "Erkundung einer dichteren Umgebung mit komplexeren Interaktionen. Einführung früher räuberischer Elemente und vielfältiger Ressourcentypen.",
  "phase1.stadium10.title": "Stadionkonzept 10",
  "phase1.stadium10.description": "Verfeinerung der Ästhetik mit Fokus auf atmosphärische Beleuchtung und abgegrenzte Zonen innerhalb des Startbereichs. Hervorhebung von Sicherheitszonen und Gefahrenzonen.",
  "phase1.stadium11.title": "Stadionkonzept 11",
  "phase1.stadium11.description": "Finalisierung des Erscheinungsbildes für die anfängliche Ressourcensammelphase. Ausgewogenheit zwischen visueller Attraktivität und Lesbarkeit des Gameplays für einen reibungslosen Einstieg der Spieler."
}
